1er_proyecto/app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Lucrecia', 'Lyde', 'Lucre', 'lucreciasoraya@gmail.com', '$2y$10$ha97SqOfXPyYHbq7BcM3wOcXCIyfbGoJtdTe6.DDPTCJlhcR1evje')
---
    public function formValidation(){

        $input = $this->validate ([
            'nombre' => 'required|min_length[3]',
            'apellido' => 'required|min_length[3]|max_length[25]',
            'usuario' => 'required|min_length[3]',
            'email' => 'required|min_length[4]|max_length[100]',
            'pass' => 'required|min_length[3]|max_length[10]'
        ],
    );
    $formModel = new usuario_Model();

    if (!$input){
        $data['titulo']= 'Registro';
        echo view('front/head_view',$data);
        echo view('front/nav_view');
        echo view('Back/usuario/registro_base',['validation' => $this->validator]);
        echo view('front/footer_view');
    }else {
       $formModel->save([
        'nombre' => $this->request->getVar ('nombre'),
        'apellido' => $this->request->getVar ('apellido'),
        'usuario' => $this->request->getVar ('usuario'),
        'email' => $this->request->getVar ('email'),
        'pass' => password_hash ($this ->request->getVar('pass'), PASSWORD_DEFAULT)
      //password_hash() crea un nuevo hash de cntraseña usando un algoritmo de
      //hash de unico sentido.

    ]);